[
  {
    "id": "kb-001",
    "content": "SMOKE ALARM MAINTENANCE\n\nIf your smoke alarm is beeping intermittently (usually once every 30-60 seconds), this typically indicates a low battery. Here's how to resolve this:\n\n1. Locate the smoke alarm on your ceiling\n2. Twist the alarm anti-clockwise to remove it from the mounting plate\n3. Open the battery compartment on the back\n4. Remove the old 9V battery\n5. Insert a new 9V battery, ensuring correct polarity (+/-)\n6. Close the battery compartment\n7. Press and hold the test button for 3 seconds - you should hear a loud beep\n8. Twist the alarm back onto the mounting plate (clockwise)\n\nIf the beeping continues after replacing the battery, the alarm unit itself may need replacing. Contact the maintenance team to arrange a replacement.\n\nNever remove batteries from smoke alarms or disconnect them. Working smoke alarms are a legal requirement and essential for your safety."
  },
  {
    "id": "kb-002",
    "content": "BOILER PRESSURE - LOW PRESSURE TROUBLESHOOTING\n\nIf your heating isn't working and the boiler pressure gauge shows below 1 bar, you'll need to repressurise the system. This is a simple process you can do yourself.\n\nLocating the filling loop:\nThe filling loop is usually located underneath your boiler. It consists of a flexible silver hose connecting two pipes, with a valve at each end (small taps or levers).\n\nRepressurising steps:\n1. Ensure the boiler is switched off and has cooled down\n2. Locate the filling loop beneath the boiler\n3. You'll see two valves - these need to be opened to allow water into the system\n4. Slowly open the first valve by turning it anti-clockwise\n5. Slowly open the second valve\n6. Watch the pressure gauge on the boiler - you'll hear water flowing\n7. When the gauge reaches between 1 and 1.5 bar, close both valves\n8. Close the second valve first, then the first\n9. Switch the boiler back on\n\nThe pressure should now be correct and your heating should work normally.\n\nImportant: If the pressure drops again within 24-48 hours, there may be a leak in the system. In this case, do not attempt further repairs yourself - contact the maintenance team to arrange an engineer visit.\n\nNever increase the pressure above 2.5 bar as this can damage the system."
  },
  {
    "id": "kb-003",
    "content": "RESIDENT PARKING POLICY\n\nParking Permit Allocation\nEach residential unit is entitled to one parking permit. Additional permits may be available subject to availability and will incur an additional monthly charge as specified in your tenancy agreement.\n\nPermit Display\nPermits must be clearly displayed on the dashboard of the registered vehicle at all times when parked in resident bays. Failure to display a valid permit may result in a parking charge notice.\n\nVisitor Parking\nVisitor parking spaces are available on a first-come, first-served basis. Visitors must register their vehicle using the visitor parking app or at the concierge desk. Maximum visitor parking duration is 4 hours unless prior arrangement has been made with building management.\n\nProhibited Vehicles\nThe following are not permitted in the car park:\n- Commercial vehicles over 3.5 tonnes\n- Caravans or trailers\n- Vehicles leaking oil or fluids\n- Uninsured or untaxed vehicles\n- Vehicles without valid MOT\n\nEnforcement\nParking enforcement is carried out 24 hours a day, 7 days a week. Vehicles parked in violation of these rules may receive a Parking Charge Notice of £100, reduced to £60 if paid within 14 days.\n\nAppeals\nTo appeal a parking charge, submit your appeal in writing to the building management office within 14 days of the notice date, including any supporting evidence.\n\nElectric Vehicle Charging\nEV charging points are available in designated bays. Usage is charged at the current electricity rate plus a service fee. Contact the management office to register for EV charging access."
  },
  {
    "id": "kb-004",
    "content": "POWER OUTAGE - PARTIAL LOSS OF ELECTRICITY\n\nIf some areas of your flat have power but others don't, this is usually caused by a tripped circuit breaker rather than a supply issue.\n\nCheck your consumer unit (fuse box):\n1. Locate your consumer unit - usually in a cupboard near your front door\n2. Open the cover to see the switches\n3. Look for any switches that have moved to the OFF or middle position\n4. Before resetting, unplug any appliances that were in use when the power was lost\n\nTo reset:\n1. Push the tripped switch firmly to the OFF position first\n2. Then push it back to the ON position\n3. If it stays on, the problem is resolved\n\nIf the switch trips again immediately, there may be a fault with an appliance or the circuit itself. Leave the switch off and contact the maintenance team.\n\nNever attempt to repair or modify your consumer unit yourself."
  },
  {
    "id": "kb-005",
    "content": "NOISE POLICY AND QUIET HOURS\n\nRiverside Court is committed to providing a peaceful living environment for all residents. This policy outlines acceptable noise levels and procedures for addressing noise concerns.\n\nQuiet Hours\nQuiet hours are in effect during the following times:\n- Monday to Thursday: 10:00 PM to 8:00 AM\n- Friday and Saturday: 11:00 PM to 9:00 AM\n- Sunday: 10:00 PM to 9:00 AM\n\nDuring quiet hours, residents must ensure that noise from their property is not audible in neighbouring units. This includes but is not limited to:\n- Television and music\n- Conversations and gatherings\n- DIY and construction work\n- Musical instruments\n- Domestic appliances (washing machines, vacuum cleaners)\n\nGeneral Noise Guidelines\nOutside of quiet hours, residents should still be mindful of noise levels. Excessive noise that disturbs neighbours is not acceptable at any time. Construction and DIY work is only permitted Monday to Saturday, 9:00 AM to 6:00 PM, and is not permitted on Sundays or bank holidays.\n\nReporting Noise Issues\nIf you are experiencing noise disturbance:\n1. Where safe and appropriate, speak directly with your neighbour first\n2. If the issue persists, report it to building management in writing\n3. Keep a log of disturbances including dates, times, and nature of noise\n4. For serious disturbances during unsociable hours, contact the out-of-hours security team\n\nEnforcement\nRepeated or serious breaches of this policy may result in:\n- Written warning\n- Mediation meeting\n- Formal breach of tenancy notice\n- Legal action in severe cases\n\nParties and Events\nResidents planning a gathering should notify immediate neighbours in advance and ensure compliance with quiet hours. Large parties or events require prior approval from building management."
  },
  {
    "id": "kb-006",
    "content": "WASHING MACHINE NOT DRAINING\n\nIf your washing machine has water sitting at the bottom after a cycle, or clothes are coming out soaking wet, the most common cause is a blocked filter or drain hose.\n\nCleaning the filter:\n1. Place old towels on the floor in front of the machine\n2. Locate the filter access panel (usually bottom-right front of machine)\n3. Place a shallow container under the filter to catch water\n4. Slowly unscrew the filter cap - water will begin to drain\n5. Remove any debris, coins, hair clips, or lint from the filter\n6. Check inside the filter housing and remove any blockages\n7. Replace the filter, ensuring it's screwed in securely\n8. Run a short spin cycle to test\n\nIf this doesn't resolve the issue, check the drain hose at the back of the machine isn't kinked or blocked."
  },
  {
    "id": "kb-007",
    "content": "WASTE AND RECYCLING GUIDELINES\n\nCollection Schedule\nGeneral waste: Collected every Tuesday\nRecycling (mixed): Collected every Friday\nFood waste: Collected every Monday and Thursday\nBulky items: By appointment only\n\nRecycling - What Goes In\nYES: Clean plastic bottles and containers, cardboard and paper, glass bottles and jars, metal tins and cans, clean foil, Tetra Pak cartons\n\nNO: Plastic bags, food-contaminated packaging, polystyrene, nappies, textiles, electrical items, batteries, general waste\n\nFood Waste\nUse the provided food caddy and compostable liners for all food waste including: fruit and vegetable peelings, meat and fish (including bones), dairy products, bread, rice, pasta, tea bags and coffee grounds, egg shells.\n\nBin Store Access\nBin stores are located in the basement car park. Access is via your key fob. Ensure bags are securely tied and placed in the correct bin. Do not leave bags outside bins.\n\nBulky Waste\nFor large items (furniture, appliances, mattresses), contact building management to arrange collection. There is a charge of £25 per item for this service. Items must not be left in communal areas.\n\nPenalties\nContamination of recycling bins or improper waste disposal may result in a cleaning charge being applied to your account. Repeat offenders may face formal action under the terms of the tenancy agreement."
  },
  {
    "id": "kb-008",
    "content": "TOILET CONTINUOUSLY RUNNING\n\nA toilet that won't stop running wastes water and can be noisy. The issue is usually inside the cistern and often easy to fix.\n\nQuick check:\n1. Remove the cistern lid (lift straight up)\n2. Check if the float ball or float arm is stuck\n3. Gently lift the float arm - if the water stops, the float needs adjusting\n4. Check if the rubber flapper valve at the bottom is seated properly\n5. Look for any debris preventing a good seal\n\nSimple fixes:\n- If the float is stuck, gently free it and ensure it moves up and down freely\n- If the flapper looks worn or warped, it may need replacing (contact maintenance)\n- Clean any limescale or debris from the flapper seal area\n- Ensure the overflow pipe isn't blocked\n\nIf these steps don't work, or you're not comfortable investigating further, contact the maintenance team."
  },
  {
    "id": "kb-009",
    "content": "PET POLICY\n\nResident Pet Guidelines\n\nRiverside Court permits residents to keep pets subject to the following conditions and building management approval.\n\nPermitted Pets\nThe following pets are generally permitted with prior written approval:\n- Dogs (maximum 2, subject to breed restrictions)\n- Cats (maximum 2)\n- Small caged animals (hamsters, guinea pigs, rabbits)\n- Fish (aquarium maximum 100 litres)\n- Small caged birds\n\nRestricted Dog Breeds\nThe following breeds (and crosses) are not permitted under any circumstances, in accordance with UK law: Pit Bull Terrier, Japanese Tosa, Dogo Argentino, Fila Brasileiro. Additionally, any dog that has been classified as dangerous under the Dangerous Dogs Act is prohibited.\n\nRegistration Requirements\nAll pets must be registered with building management. Registration requires: proof of vaccinations, pet insurance documentation, microchip details for dogs, agreement to pet policy terms.\n\nResident Responsibilities\nPet owners must:\n- Keep dogs on leads in all communal areas\n- Immediately clean up after their pet\n- Ensure pets do not cause noise disturbance\n- Not leave pets unattended for extended periods\n- Prevent damage to property\n- Keep pets away from children's play areas\n\nBreaches\nFailure to comply with this policy may result in:\n- Written warning\n- Requirement to rehome the pet\n- Additional cleaning or repair charges\n- Action under tenancy breach provisions\n\nTo apply for pet permission, complete the pet registration form available from building management."
  },
  {
    "id": "kb-010",
    "content": "RADIATOR NOT HEATING UP\n\nIf one or more radiators aren't getting hot while others work fine, the most common cause is trapped air in the system.\n\nBleeding a radiator:\n1. Turn your heating on and let radiators warm up\n2. Identify which radiators are cold at the top (this indicates trapped air)\n3. Turn the heating off and let the system cool slightly\n4. Locate the bleed valve (small square fitting at top corner of radiator)\n5. Place a cloth or small container under the valve to catch water\n6. Use a radiator key to slowly turn the valve anti-clockwise\n7. You'll hear a hissing sound as air escapes\n8. When water starts to dribble out steadily, close the valve\n9. Repeat for other affected radiators\n10. Check your boiler pressure afterwards and top up if needed\n\nIf the radiator is cold at the bottom but hot at top, it may have sludge buildup requiring a professional powerflush. Contact maintenance."
  },
  {
    "id": "kb-011",
    "content": "GUEST AND VISITOR POLICY\n\nAccess Procedures\nAll visitors must be registered at reception or via the resident app before being granted building access. Residents are responsible for their guests' conduct while on the premises.\n\nShort-term Guests\nGuests staying overnight up to 14 consecutive days do not require pre-registration but must sign in at reception. Residents should inform the concierge of expected guests.\n\nLong-term Guests\nGuests staying more than 14 days must be registered with building management. Extended stays beyond 30 days may require amendment to the tenancy agreement and may incur additional service charges.\n\nRestrictions\nGuests are not permitted to:\n- Access restricted areas without resident escort\n- Park without valid visitor registration\n- Use gym facilities unless accompanied by resident\n- Make excessive noise or cause disturbance\n\nKey and Fob Policy\nResidents may not provide keys or access fobs to non-residents. Lost fobs must be reported immediately to building management. There is a £50 replacement charge for lost fobs.\n\nDeliveries\nDeliveries will be accepted at reception between 8:00 AM and 8:00 PM. Large or perishable deliveries require advance notice. Residents will be notified via the building app when a delivery arrives."
  },
  {
    "id": "kb-012",
    "content": "EMERGENCY GAS LEAK PROCEDURE\n\nIf you smell gas, act immediately. Do not ignore a gas smell.\n\nImmediate actions:\n1. Do NOT turn any electrical switches on or off\n2. Do NOT use any naked flames, matches, or lighters\n3. Do NOT smoke\n4. Open all doors and windows to ventilate\n5. Turn off the gas supply at the meter if safe to do so\n6. Evacuate the property immediately\n7. Call the National Gas Emergency Service: 0800 111 999\n\nDo not re-enter the property until cleared by a Gas Safe registered engineer.\n\nGas meter location: Your gas meter is typically located in a cupboard near your front door or in a communal meter room in the basement.\n\nThis is a life-threatening emergency - always err on the side of caution."
  }
]
